In [2]:
import pandas as pd
pd.__version__ , pd.__path__

('2.3.3',
 ['/Users/mbouderr/Library/Python/3.9/lib/python/site-packages/pandas'])

## modify rows and records in dataframe

In [3]:
data =  pd.read_csv('datasets/groupdata.csv')
data.head()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0

In [4]:
data.shape

(16, 10)

In [5]:
data.index

RangeIndex(start=0, stop=16, step=1)

In [6]:
data.dtypes

roll no         object
name            object
age              int64
address         object
session         object
group           object
gender          object
subj1          float64
subj2          float64
scholarship    float64
dtype: object

In [7]:
data.columns

Index(['roll no', 'name', 'age', 'address', 'session', 'group', 'gender',
       'subj1', 'subj2', 'scholarship'],
      dtype='object')

In [8]:
cat datasets/groupdatawithoutcollables.csv

MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000
MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000
MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500
MS04,Hadeed,20,Lahore,MOR,group A,Male,82,84.3,4000
MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500
MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,
MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,,4000
MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76,8000
MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500
MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800
MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000
MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,
MS13,Mujahid,18,Lahore,MORNING,group D,Male,,76.5,7000
MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76,8000
MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500
MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800

## add name of columns while reading the df

In [9]:
data = pd.read_csv('datasets/groupdatawithoutcollables.csv', names = ['roll no', 'name', 'age', 'address','session', 'group','gender','subj1', 'subj2', 'scholarship'] )
data.head(3)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

In [10]:
data =  pd.read_csv('datasets/groupdatawithoutcollables.csv', header = None)
data.head(3)

,0,1,2,3,4,5,6,7,8,9
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

In [11]:
data.columns = ['roll no', 'name', 'age', 'address','session', 'group','gender','subj1', 'subj2', 'scholarship']

In [12]:
data

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [13]:
data.columns

Index(['roll no', 'name', 'age', 'address', 'session', 'group', 'gender',
       'subj1', 'subj2', 'scholarship'],
      dtype='object')

In [14]:
data.columns = data.columns.str.replace(' ' , '_' )

In [15]:
data

,roll_no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

### upper case lower case

In [16]:
list = [x.capitalize() for x in data.columns]
data.columns= list
data.head(5)

,Roll_no,Name,Age,Address,Session,Group,Gender,Subj1,Subj2,Scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0

### rename

In [27]:
data = pd.read_csv('datasets/groupdata.csv')
data.rename(mapper={'roll no' : 'rollNo'},axis=1 ,inplace= True)
data.columns

Index(['rollNo', 'name', 'age', 'address', 'session', 'group', 'gender',
       'subj1', 'subj2', 'scholarship'],
      dtype='object')

### change the marks of shaista

In [28]:
data.loc[data.name == 'Shaista', ['subj1', 'subj2']]

   subj1  subj2
2   64.9   75.1

In [31]:
data.loc[data.name == 'Shaista', ['subj1']] = [101]

# data.loc[data.name == 'Rauf',:]

### map function

In [20]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

In [32]:
  df['name'].map(len)

0     4
1     4
2     7
3     6
4     4
5     5
6     5
7     6
8     5
9     6
10    7
11    4
12    7
13    4
14    6
15    9
Name: name, dtype: int64

In [22]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

In [39]:
# def func(x):
    # if x <= 50:
    #     return 'Young'
    # else :
    #     return 'old'

df['Young/old'] =  data['age'].map(lambda x: 'young' if x <30 else 'old')
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship,Young/old,result
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0,old,Pass
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0,old,Fail
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0,old,Fail
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0,young,Pass
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0,old,Fail
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN,young,Fail
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0,old,Fail
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0,old,Pass
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0,old,Pass
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0,old,Pass
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0,old,Pass
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN,young,Pass
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0,young,Fail
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0,young,Pass
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0,old,Pass
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0,old,Pass

In [42]:
def func2(x):
    if x > 80 :
        return 'Pass'
    else :
        return 'Fail'
df['result'] = ((df['subj1']+df['subj2'])/2).map(func2)
df.head()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship,Young/old,result
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0,old,Pass
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0,old,Fail
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0,old,Fail
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0,young,Pass
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0,old,Fail

In [49]:
df = pd.read_csv('datasets/groupdata.csv')
df['session']= df['session'].map({'MORNING':'M','AFTERNOON':'A' })  
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,M,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,NaN,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,A,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,NaN,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,NaN,group D,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,M,group C,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,NaN,group B,Female,90.2,NaN,4000.0
7,MS08,Idrees,51,Multan,M,group D,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,NaN,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,A,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,NaN,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,A,group C,Male,90.5,81.3,NaN
12,MS13,Mujahid,18,Lahore,M,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,A,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33,Sialkot,NaN,group C,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,A,group A,Male,90.5,81.3,3800.0

### to avoid the Nan value on the other values  we use replace()

In [55]:
df =  pd.read_csv('datasets/groupdata.csv')
df['session'] =  df['session'].replace({'MORNING':'M','AFTERNOON':'A' })
df[['session']]

   session
0        M
1      AFT
2        A
3      MOR
4      AFT
5        M
6      AFT
7        M
8      AFT
9        A
10     MOR
11       A
12       M
13       A
14     AFT
15       A

### USE replace() on  entire dataframe

In [58]:
df =  pd.read_csv('datasets/groupdata.csv')
df.replace({'MORNING':'M','AFTERNOON':'AAAAA' })

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,M,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AAAAA,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,M,group C,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,MS08,Idrees,51,Multan,M,group D,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AAAAA,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,AAAAA,group C,Male,90.5,81.3,NaN
12,MS13,Mujahid,18,Lahore,M,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,AAAAA,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AAAAA,group A,Male,90.5,81.3,3800.0